In [2]:
import pandas as pd
pd.__version__

'1.4.3'

In [6]:
people = {
    'first_name': ['Ali', 'Raib', 'Seli'],
    'last_name': ['Bumi', 'Bulan', 'Matahari'],
    'email': ['alibumi@gmail.com', 'raibbintang@gmail.com', 'selimatahari@gmail.com']
}

df = pd.DataFrame(people)

In [7]:
df

  first_name last_name                   email
0        Ali      Bumi       alibumi@gmail.com
1       Raib     Bulan   raibbintang@gmail.com
2       Seli  Matahari  selimatahari@gmail.com

In [8]:
df['email']

0         alibumi@gmail.com
1     raibbintang@gmail.com
2    selimatahari@gmail.com
Name: email, dtype: object

In [11]:
df.set_index('email')

                       first_name last_name
email
alibumi@gmail.com             Ali      Bumi
raibbintang@gmail.com        Raib     Bulan
selimatahari@gmail.com       Seli  Matahari

In [12]:
df

  first_name last_name                   email
0        Ali      Bumi       alibumi@gmail.com
1       Raib     Bulan   raibbintang@gmail.com
2       Seli  Matahari  selimatahari@gmail.com

In [13]:
df.set_index('email', inplace=True)

In [14]:
df

                       first_name last_name
email
alibumi@gmail.com             Ali      Bumi
raibbintang@gmail.com        Raib     Bulan
selimatahari@gmail.com       Seli  Matahari

In [15]:
df.index

Index(['alibumi@gmail.com', 'raibbintang@gmail.com', 'selimatahari@gmail.com'], dtype='object', name='email')

In [24]:
df.loc['alibumi@gmail.com', 'first_name']

'Ali'

In [27]:
df.iloc[0]

first_name     Ali
last_name     Bumi
Name: alibumi@gmail.com, dtype: object

In [30]:
df.iloc[0, 0]

'Ali'

In [31]:
df.reset_index(inplace=True)

In [32]:
df

                    email first_name last_name
0       alibumi@gmail.com        Ali      Bumi
1   raibbintang@gmail.com       Raib     Bulan
2  selimatahari@gmail.com       Seli  Matahari